In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
games_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(games_to_load)

In [2]:
#drop duplicate SN in 3 columns
players_data2 = purchase_data.loc[:,["Gender","SN","Age"]]
players_data2 = players_data2.drop_duplicates()
players_data2

     Gender             SN  Age
0      Male        Lisim78   20
1      Male    Lisovynya38   40
2      Male     Ithergue48   24
3      Male  Chamassasya86   24
4      Male      Iskosia90   23
..      ...            ...  ...
773    Male         Hala31   21
774    Male     Jiskjask80   11
775  Female     Aethedru70   21
777    Male     Yathecal72   20
778    Male        Sisur91    7

[576 rows x 3 columns]

In [3]:
#total number of players code
total_players = len(purchase_data["SN"].unique())
total_players

576

In [4]:
#total number of players dataframe
total_players_df = pd.DataFrame([{"Totals Players" : total_players}])
total_players_df

   Totals Players
0             576

In [5]:
#total number of unique items code
total_unique_items = len(purchase_data["Item Name"].unique())
total_unique_items

179

In [6]:
#average purchase price code
average_price = purchase_data["Price"].mean()
average_price = round (average_price,2)
average_price

3.05

In [7]:
#total number of purchases code
total_purchases = len(purchase_data["Purchase ID"].value_counts())
total_purchases

780

In [8]:
#total revenue code
total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [9]:
#purchasing analysis (total) dataframe
purchasing_analysis_totaldf = pd.DataFrame([{"Number of Unique Items" : total_unique_items
                                         ,"Average Purchase Price" : average_price
                                         ,"Total Number of Purchases" : total_purchases
                                         ,"Total Revenue" : total_revenue}])
purchasing_analysis_totaldf

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,179,3.05,780,2379.77

In [10]:
#gender groupby code
total_gender = purchase_data[["SN", "Gender"]].groupby("SN").first()
total_gender

               Gender
SN
Adairialis76     Male
Adastirin33    Female
Aeda94           Male
Aela59           Male
Aelaria33        Male
...               ...
Yathecal82     Female
Yathedeu43       Male
Yoishirrala98  Female
Zhisrisu83       Male
Zontibe81        Male

[576 rows x 1 columns]

In [11]:
#value count for gender groupby code
gender_totals = total_gender["Gender"].value_counts()
gender_totals

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [12]:
#gender groupby percentage code
gender_percent = gender_totals.apply(lambda x: 100*x/total_players)
gender_percent = round(gender_percent,2)
gender_percent

Male                     84.03
Female                   14.06
Other / Non-Disclosed     1.91
Name: Gender, dtype: float64

In [13]:
#gender demographics dataframe; need to merge gender column
gender_demo = pd.concat([gender_totals , gender_percent],axis = 1)
gender_demo

                       Gender  Gender
Male                      484   84.03
Female                     81   14.06
Other / Non-Disclosed      11    1.91

In [14]:
#gender analysis; total avg purchase price
total_gender2 = purchase_data[["SN", "Gender" , "Price"]].groupby("SN").agg({"Gender" : "first" , "Price" : "sum"})
total_gender2 = total_gender2.groupby("Gender").mean()

total_gender2 = pd.DataFrame(total_gender2.apply(lambda x: "${:.2f}".format(x['Price']), axis=1), columns = ["Avg Total Purchase per Person"])
total_gender2

                      Avg Total Purchase per Person
Gender
Female                                        $4.47
Male                                          $4.07
Other / Non-Disclosed                         $4.56

In [15]:
#gender analysis dataframe; Purchase Count,Average Purchase Price,Total Purchase Value
total_gender3 = purchase_data[["Gender" , "Price"]].groupby("Gender").agg({"Price" : ["count" , "mean" , "sum"]})
total_gender3.columns = ["Purchase Count", "Average Purchase Price" , "Total Purchase Value"]
total_gender3[["Average Purchase Price" , "Total Purchase Value"]] = total_gender3[["Average Purchase Price" , "Total Purchase Value"]].applymap(lambda x: "${:,.2f}".format(x))
total_gender3

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,$3.20,$361.94
Male,652,$3.02,"$1,967.64"
Other / Non-Disclosed,15,$3.35,$50.19

In [16]:
#final gender analysis dataframe merged
gender_analysis = pd.concat([total_gender3 , total_gender2],axis = 1)
gender_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [17]:
#bin ages total count and percentage code/dataframe
bin_names = ["<10", "10-14", "15-19", "20-24","25-29","30-34", "35-39","40+"]
players_data2['Age_Ranges'] = pd.cut(players_data2['Age'], bins=[0, 9.9, 14.9,19.9,24.9,29.9,34.9,39.9,9999],labels = bin_names)
age_demo_total = players_data2["Age_Ranges"].value_counts()
percent_age_demo = age_demo_total/total_players*100
percent_age_demo
age_demo_df = pd.DataFrame({"Total Count" : age_demo_total , "Percentage of Players" : percent_age_demo })
age_demo_df = age_demo_df.sort_index()
age_demo_df

       Total Count  Percentage of Players
<10             17               2.951389
10-14           22               3.819444
15-19          107              18.576389
20-24          258              44.791667
25-29           77              13.368056
30-34           52               9.027778
35-39           31               5.381944
40+             12               2.083333

In [19]:
#Purchase Count, Average Purchase Price, Total Purchase Value ,Average Purchase Total per Person by Age Group analysis code
purchase_data["Age Ranges"] = pd.cut(purchase_data["Age"],bins=[0, 9.9, 14.9,19.9,24.9,29.9,34.9,39.9,9999], labels = bin_names)
count_age_purchases = purchase_data.groupby(["Age Ranges"]).count()["Price"]

average_age_purchase = purchase_data.groupby(["Age Ranges"]).mean()["Price"]
total_age_purchase = purchase_data.groupby(["Age Ranges"]).sum()["Price"]
avg_per_person = total_age_purchase/age_demo_df["Total Count"]

age_analysis_df = pd.DataFrame({"Purchase Count" :count_age_purchases, 
                                "Average Purchase Price" : average_age_purchase, 
                                "Total Purchase Value" : total_age_purchase, 
                                "Average Purchase Total per Person by Age Group": avg_per_person })
age_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person by Age Group
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [22]:
#top 5 purchasers groupby code and dataframe
top_five_count = purchase_data.groupby(["SN"]).count()["Price"]
top_five_average = purchase_data.groupby(["SN"]).mean()["Price"]
top_five_total = purchase_data.groupby(["SN"]).sum()["Price"]
top_five_df = pd.DataFrame({"Purchase Count" :top_five_count 
                            , "Average Purchase Value" : top_five_average 
                           , "Total Purchase Value" :top_five_total })
top_five_df = top_five_df.sort_values("Total Purchase Value",ascending = False)
top_five_df.head(5)

             Purchase Count  Average Purchase Value  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [27]:
#most popular items code and dataframe
most_popular_items_data = purchase_data.loc[:,["Item ID","Item Name","Price"]]
most_popular_count = most_popular_items_data.groupby(["Item ID" , "Item Name"]).count()["Price"]
most_popular_total = most_popular_items_data.groupby(["Item ID" , "Item Name"]).sum()["Price"]
most_popular_average = most_popular_items_data.groupby(["Item ID" , "Item Name"]).mean()["Price"]
most_popular_df = pd.DataFrame({"Purchase Count" :most_popular_count 
                            , "Item" : most_popular_average
                           , "Total Purchase Value" :most_popular_total })
most_popular_df = most_popular_df.sort_values("Purchase Count",ascending = False)
most_popular_df.head(5)

,,Purchase Count,Item,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [28]:
#most profitable items code and dataframe
most_popular_items_data = purchase_data.loc[:,["Item ID","Item Name","Price"]]
most_popular_count = most_popular_items_data.groupby(["Item ID" , "Item Name"]).count()["Price"]
most_popular_total = most_popular_items_data.groupby(["Item ID" , "Item Name"]).sum()["Price"]
most_popular_average = most_popular_items_data.groupby(["Item ID" , "Item Name"]).mean()["Price"]
most_popular_df = pd.DataFrame({"Purchase Count" :most_popular_count 
                            , "Item" : most_popular_average
                           , "Total Purchase Value" :most_popular_total })
most_popular_df = most_popular_df.sort_values("Total Purchase Value",ascending = False)
most_popular_df.head(5)

,,Purchase Count,Item,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80

Pymoli Analysis
-purchases are mainly conducted by males which correlates to a higher male sales total. For 652	male purchases, that equates to a male sales total of $1,967.64.
-The age groups with most demand of the game are teenagers and young adults, ranging from 15-30 years old. Target market should be directed towards this group; possible advertising channels include social media, television, recreational/leisure establishments, etc.
-The "Final Critic" item is the most popular and most profitable item, meaning it is an integral part of the game and should continue to receive precedence.